cases/serpentine/constant/appliedCurrent
inputValue 1.05644;
