cases/serpentine/system/fvSolution_SS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
       // nAlphaCorr      1;
        //nAlphaSubCycles 2;
        //cAlpha          1;
	interfaceMethod "isoAdvector";
        isoFaceTol      1e-6;
        surfCellTol     1e-6;
        snapTol         0;	//1e-12;
        nAlphaBounds    3;
        clip            false;

        nAlphaCorr      2;
        nAlphaSubCycles 2;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
"alpha.O2|alpha.O2Final"
{
   solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-08;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
 UFinal
    {
        $U;
        tolerance       1e-08;
      //  relTol          0;
    }

//laplacianfoam
 T
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
//SimpleTransportFlow
T
    {
      solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

//simplefoam
p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
    
//charge transport
  fi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;//0.5;
    }
    fiFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;//0.5;
    }

}

PIMPLE
{
     momentumPredictor no;
    nCorrectors     3;
    nOuterCorrectors    1;
    nNonOrthogonalCorrectors 1;
    nAlphaCorr      1;
    nAlphaSubCycles 1;
    cAlpha          1;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|epsilon)" 1e-4;
        T		1e-4;
        fi		1e-4;
        
    }
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;

}

relaxationFactors
{
    fields
    {
        p               0.3;
        C		0.3;
        T 		0.3;
        fi		0.3;
    }
    equations
    {
        U               0.3;
        T		0.7;
        fi		0.5;
        "(k|omega|epsilon).*" 0.7;
    }
}


// ************************************************************************* //
