cases/serpentine/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }

defaultFieldValues ( volScalarFieldValue porosity 0.999999 );
regions
(
    boxToCell
    {
        type box;
        box (-0.00499 -0.00499 0) (0.00499 0.00499 0.00035);
        fieldValues ( volScalarFieldValue porosity 0.70 );
    }
);
